Elemc=[42378137;0;pi/4;pi/3;pi/6;0];
RVc=El2RV(Elemc);
d1=RV2El(RVc);
%坐标转轨道根数
RVd=[5329617.73754407;39267747.4312178;15018289.3624356;-2391.23447873877;-394.032539869797;1879.89802280797];
d2=RV2El(RVd);
RVd2=[5426883.47171147;39264400.3443057;15004713.8103962;-2391.61345990900;-386.198301648115;1875.07661761500];
d3=RV2El(RVd2);
RVd3=[5349670.11605860;39246202.2482287;14939632.7531870;-2396.70819802386;-386.657220698055;1879.25933072313];
d4=RV2El(RVd3);



a=42378137;e=0;wc=pi/6;Wc=pi/3;ic=pi/4;%fc=n*t;%主星轨道根数
%uc=wc+fc;%近地点幅角加真近地点角
A0=[(cos(wc)*cos(Wc)-sin(wc)*cos(ic)*sin(Wc)),(cos(wc)*sin(Wc)+sin(wc)*cos(ic)*cos(Wc)),sin(wc)*sin(ic);
    (-sin(wc)*cos(Wc)-cos(wc)*cos(ic)*sin(Wc)),(-sin(wc)*sin(Wc)+cos(wc)*cos(ic)*cos(Wc)),cos(wc)*sin(ic);
    -sin(ic)*sin(Wc),-sin(Wc),cos(ic);];